In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [2]:
### Check for missing data
purchase_data_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [3]:
pcount = purchase_data_df['SN'].nunique()
pcount

576

# Player Count & Revenue

In [4]:

pcount = purchase_data_df['SN'].value_counts()
pcount

Lisosia93      5
Idastidru52    4
Iral74         4
Iri67          3
Phyali88       3
              ..
Quilassa66     1
Haisurra41     1
Assilsan72     1
Iskosian40     1
Chadirra90     1
Name: SN, Length: 576, dtype: int64

In [5]:
### Player Count convert into dataframe
pcount2_df = pd.DataFrame(pcount)
pcount2_df

             SN
Lisosia93     5
Idastidru52   4
Iral74        4
Iri67         3
Phyali88      3
...          ..
Quilassa66    1
Haisurra41    1
Assilsan72    1
Iskosian40    1
Chadirra90    1

[576 rows x 1 columns]

In [6]:
### Purchasing Analysis (Number of Unique Items)
count = purchase_data_df["Item Name"].value_counts()
len(count)

179

In [7]:
### Average Purchase Price

average = purchase_data_df["Price"].mean()
average.round(decimals=2)

3.05

In [8]:
### Total Number of Purchases
total_purchases = purchase_data_df["Purchase ID"].count()
total_purchases

780

In [9]:
### Total Revenue
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2379.77

In [10]:
### Table of items above viewed together
purchasing_analysis = pd.DataFrame({"Total Number of Players":[len(pcount)],
    "Number of Unique Items":[len(count)],
                                    "Average Purchase Price":[average.round(decimals=2)],
                                    "Total Number of Purchases":[total_purchases],
                                    "Total Revenue":[total_revenue]})
purchasing_analysis['Total Revenue'] = purchasing_analysis['Total Revenue'].map('${:,.2f}'.format)
purchasing_analysis['Average Purchase Price'] = purchasing_analysis['Average Purchase Price'].map('${:,.2f}'.format)
purchasing_analysis

,Total Number of Players,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,576,179,$3.05,780,"$2,379.77"

# Gender Demographics

In [11]:
male_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Male',]
male_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [12]:
#extract Gender and SN column
gender_group_df = purchase_data_df[['Gender', 'SN']]
gender_group_df

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
775  Female     Aethedru70
776    Male         Iral74
777    Male     Yathecal72
778    Male        Sisur91
779    Male      Ennrian78

[780 rows x 2 columns]

In [13]:

gender_group2_df = gender_group_df.groupby(['Gender'])
gender_group2_df

In [14]:
gender_group2_df['SN'].count
gender_group2_df.head()

                    Gender             SN
0                     Male        Lisim78
1                     Male    Lisovynya38
2                     Male     Ithergue48
3                     Male  Chamassasya86
4                     Male      Iskosia90
9    Other / Non-Disclosed    Chanosian48
15                  Female      Lisassa64
18                  Female      Reunasu60
22   Other / Non-Disclosed   Siarithria38
38                  Female       Reulae52
41                  Female      Assosia88
55                  Female      Phaelap26
82   Other / Non-Disclosed     Haerithp41
111  Other / Non-Disclosed       Sundim98
228  Other / Non-Disclosed    Jiskirran77

In [15]:
#amount of male
male_gender_count = male_gender_df["SN"].value_counts()
len(male_gender_count)

484

In [16]:
#amount of female
female_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Female',]
female_gender_df.head()
female_gender_count = female_gender_df["SN"].value_counts()
len(female_gender_count)

81

In [17]:
#dataframe for other
other_gender_df = purchase_data_df.loc[purchase_data_df['Gender'] == 'Other / Non-Disclosed',]
other_gender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [18]:
#amount of Other
other_gender_count = other_gender_df["SN"].value_counts()
len(other_gender_count)

11

In [19]:
### Add gender counts & percentages to a dataframe
raw_count = {
    'Total Count':[len(male_gender_count), len(female_gender_count), len(other_gender_count)],
    'Percentage of Players':[len(male_gender_count)/576*100, 
                             len(female_gender_count)/576*100, 
                             len(other_gender_count)/576*100]   
} 

gender_df = pd.DataFrame(raw_count, index=['Male', 'Female', 'Other / Non-Disclosed'],
                         columns=[
    'Total Count', 'Percentage of Players'])
gender_df

gender_df['Percentage of Players'] = gender_df['Percentage of Players'].map('{:,.2f}%'.format)



gender_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

# Purchasing Analysis (Gender)

In [20]:
puranalysis_cnt = purchase_data_df.groupby(['Gender'])['Price'].count()
puranalysis_cnt

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [21]:
# grouped_counts = purchase_data_df.groupby(['Gender'])
# print(grouped_counts)
# grouped_counts.count().head(3)

In [22]:
### Add Purchasing Analysis to a dataframe
puranalysis_cnt = purchase_data_df.groupby(['Gender'])['Price'].count()
puranalysis_avg = purchase_data_df.groupby(['Gender'])['Price'].mean()
puranalysis_total = purchase_data_df.groupby(['Gender'])['Price'].sum()
puranalysis_gender_cnt = purchase_data_df.drop_duplicates(subset='SN')['Gender'].value_counts()
                                         
avg_purchase = puranalysis_total/ puranalysis_gender_cnt
                                           
puranalysis_df = pd.DataFrame({
    'Purchase Count': puranalysis_cnt,
    'Average Purchase Price': puranalysis_avg,
    'Total Purchase Value': puranalysis_total,
    'Avg Total Purchase per Person': avg_purchase
})

puranalysis_df['Average Purchase Price'] = puranalysis_df['Average Purchase Price'].map('${:,.2f}'.format)
puranalysis_df['Total Purchase Value'] = puranalysis_df['Total Purchase Value'].map('${:,.2f}'.format)
puranalysis_df['Avg Total Purchase per Person'] = puranalysis_df['Avg Total Purchase per Person'].map('${:,.2f}'.format)

puranalysis_df.head()

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

#  Age Demographics

In [23]:
#Create the bins
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 200 ]
age_labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [24]:
# #drop duplicates
unique_sn_df = purchase_data_df.drop_duplicates(subset='SN')['Age'].to_frame()
unique_sn_df.head(780)

     Age
0     20
1     40
2     24
3     24
4     23
..   ...
773   21
774   11
775   21
777   20
778    7

[576 rows x 1 columns]

In [25]:
#categorize existing players into bins
unique_sn_df ['Age Summary'] = pd.cut(unique_sn_df['Age'], bins, labels=age_labels)
unique_sn_df

     Age Age Summary
0     20       20-24
1     40         40+
2     24       20-24
3     24       20-24
4     23       20-24
..   ...         ...
773   21       20-24
774   11       10-14
775   21       20-24
777   20       20-24
778    7         <10

[576 rows x 2 columns]

In [26]:
#count number of SN in each bin without duplicates 
age_demo = unique_sn_df['Age Summary'].value_counts()
age_demo

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Summary, dtype: int64

In [27]:
age_demo_calc_df = pd.DataFrame(age_demo)
age_demo_calc_df

       Age Summary
20-24          258
15-19          107
25-29           77
30-34           52
35-39           31
10-14           22
<10             17
40+             12

In [28]:
total=age_demo_calc_df ['Age Summary'].sum()
total

576

In [29]:
age_demo_calc_df['Percentage of Players'] = round((age_demo_calc_df['Age Summary']/ total)*100, 2).map('{:,.2f}%'.format)

age_demo_calc_df

       Age Summary Percentage of Players
20-24          258                44.79%
15-19          107                18.58%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
10-14           22                 3.82%
<10             17                 2.95%
40+             12                 2.08%

In [36]:
final_age_demo_calc_df = age_demo_calc_df.rename(columns={'Age Summary':'Total Count'})
final_age_demo_calc_df

       Total Count Percentage of Players
20-24          258                44.79%
15-19          107                18.58%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
10-14           22                 3.82%
<10             17                 2.95%
40+             12                 2.08%

In [43]:
final_age_demo_calc_df.sort_index()

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

# Purchasing Analysis (Age)

In [32]:
### Group Percentages of each gender

In [33]:
# Finally, export this file to a spread so we can keep track of out new future watch list without the index
# unknown_movies_df.to_excel("output/movieWatchlist.xlsx", index=False)